redis_lua/reentry_lock/benchmark/get_benchmark_result.txt
====== GET ======
  100000 requests completed in 42.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 13 milliseconds
0.00% <= 14 milliseconds
0.60% <= 15 milliseconds
4.19% <= 16 milliseconds
12.65% <= 17 milliseconds
21.34% <= 18 milliseconds
30.22% <= 19 milliseconds
38.65% <= 20 milliseconds
49.64% <= 21 milliseconds
60.71% <= 22 milliseconds
71.96% <= 23 milliseconds
81.19% <= 24 milliseconds
87.41% <= 25 milliseconds
91.01% <= 26 milliseconds
93.66% <= 27 milliseconds
95.61% <= 28 milliseconds
97.12% <= 29 milliseconds
97.88% <= 30 milliseconds
98.21% <= 31 milliseconds
98.41% <= 32 milliseconds
98.61% <= 33 milliseconds
98.89% <= 34 milliseconds
99.13% <= 35 milliseconds
99.26% <= 36 milliseconds
99.36% <= 37 milliseconds
99.40% <= 38 milliseconds
99.50% <= 39 milliseconds
99.55% <= 40 milliseconds
99.60% <= 41 milliseconds
99.65% <= 42 milliseconds
99.67% <= 43 milliseconds
99.68% <= 44 milliseconds
99.71% <= 45 milliseconds
99.72% <= 46 milliseconds
99.73% <= 47 milliseconds
99.74% <= 48 milliseconds
99.75% <= 49 milliseconds
99.75% <= 50 milliseconds
99.77% <= 51 milliseconds
99.78% <= 52 milliseconds
99.79% <= 53 milliseconds
99.79% <= 54 milliseconds
99.81% <= 55 milliseconds
99.83% <= 56 milliseconds
99.84% <= 57 milliseconds
99.84% <= 58 milliseconds
99.85% <= 59 milliseconds
99.87% <= 60 milliseconds
99.87% <= 61 milliseconds
99.88% <= 62 milliseconds
99.88% <= 63 milliseconds
99.88% <= 64 milliseconds
99.88% <= 65 milliseconds
99.89% <= 66 milliseconds
99.89% <= 67 milliseconds
99.90% <= 68 milliseconds
99.90% <= 70 milliseconds
99.90% <= 71 milliseconds
99.90% <= 72 milliseconds
99.91% <= 73 milliseconds
99.92% <= 74 milliseconds
99.93% <= 75 milliseconds
99.93% <= 76 milliseconds
99.93% <= 77 milliseconds
99.93% <= 78 milliseconds
99.94% <= 79 milliseconds
99.94% <= 82 milliseconds
99.95% <= 83 milliseconds
99.95% <= 85 milliseconds
99.95% <= 109 milliseconds
99.95% <= 110 milliseconds
99.96% <= 111 milliseconds
99.96% <= 112 milliseconds
99.96% <= 113 milliseconds
99.97% <= 114 milliseconds
99.97% <= 115 milliseconds
99.97% <= 116 milliseconds
99.97% <= 117 milliseconds
99.98% <= 118 milliseconds
99.98% <= 119 milliseconds
99.98% <= 121 milliseconds
99.99% <= 123 milliseconds
99.99% <= 125 milliseconds
100.00% <= 129 milliseconds
100.00% <= 236 milliseconds
100.00% <= 246 milliseconds
2334.92 requests per second


# 跟 get 一样拉